# Pokemon

### Introduction:

This time you will create the data.



### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create a data dictionary that looks like the DataFrame below

In [6]:
{'evolution': ['Ivysaur','Charmeleon','Wartortle','Metapod'],
'hp': [45, 39, 44, 45],
'name': ['Bulbasaur','Charmander', 'Squirtle', 'Caterpie'],
'pokedex': ['yes', 'no', 'yes', 'no'],
'type': ['grass', 'fire', 'water', 'bug']}

{'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
 'hp': [45, 39, 44, 45],
 'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
 'pokedex': ['yes', 'no', 'yes', 'no'],
 'type': ['grass', 'fire', 'water', 'bug']}

### Step 3. Assign it to a variable called pokemon_dict; Create a dataframe with name pokemon_df

In [9]:
pokemon_dict = {'evolution': ['Ivysaur','Charmeleon','Wartortle','Metapod'],
'hp': [45, 39, 44, 45],
'name': ['Bulbasaur','Charmander', 'Squirtle', 'Caterpie'],
'pokedex': ['yes', 'no', 'yes', 'no'],
'type': ['grass', 'fire', 'water', 'bug']}

pokemon_df = pd.DataFrame(pokemon_dict)
pokemon_df

    evolution  hp        name pokedex   type
0     Ivysaur  45   Bulbasaur     yes  grass
1  Charmeleon  39  Charmander      no   fire
2   Wartortle  44    Squirtle     yes  water
3     Metapod  45    Caterpie      no    bug

### Step 4. Ops...it seems the DataFrame columns are in alphabetical order. Place  the order of the columns as name, type, hp, evolution, pokedex

In [12]:
pokemon_df = pokemon_df[['name', 'type', 'hp', 'evolution', 'pokedex']]
pokemon_df

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

### Step 5. Add another column called place, and insert what you have in mind.

In [21]:
pokemon_df['place']=['a', 'b', 'c', 'd']
pokemon_df

         name   type  hp   evolution pokedex place
0   Bulbasaur  grass  45     Ivysaur     yes     a
1  Charmander   fire  39  Charmeleon      no     b
2    Squirtle  water  44   Wartortle     yes     c
3    Caterpie    bug  45     Metapod      no     d

### Step 6. Present the type of each column

In [17]:
pokemon_df.dtypes

name         object
type         object
hp            int64
evolution    object
pokedex      object
place        object
dtype: object

### Step 7. Drop the name column

In [22]:
pokemon_df.drop(['place'], axis=1, inplace=True)
pokemon_df

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no